## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_config {
!           disk_size_gb      = 10 -> 15
!           labels            = {
!               "node_pool"    = "core" -> "istio"
                # (1 unchanged element hidden)
            }
!           local_ssd_count   = 1 -> 0
!           machine_type      = "n2-highcpu-4" -> "n2-standard-2"
!           metadata          = {
!               "node_pool"                = "core" -> "istio"
                # (2 unchanged elements hidden)
            }
!           preemptible       = false -> true
!           tags              = [
                "gke-cinema",
-               "gke-cinema-core",
+               "gke-cinema-istio",
            ]
            # (7 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

!       node_pool {
!           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-ca35a070-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-istio-97f5be0c-grp",
            ]
!           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-ca35a070-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-istio-97f5be0c-grp",
            ]
!           name                        = "core" -> "istio"
            # (5 unchanged attributes hidden)

!           autoscaling {
!               max_node_count       = 2 -> 1
                # (3 unchanged attributes hidden)
            }

!           node_config {
!               disk_size_gb      = 10 -> 15
!               labels            = {
!                   "node_pool"    = "core" -> "istio"
                    # (1 unchanged element hidden)
                }
!               local_ssd_count   = 1 -> 0
!               machine_type      = "n2-highcpu-4" -> "n2-standard-2"
!               metadata          = {
!                   "node_pool"                = "core" -> "istio"
                    # (2 unchanged elements hidden)
                }
!               preemptible       = false -> true
!               tags              = [
                    "gke-cinema",
-                   "gke-cinema-core",
+                   "gke-cinema-istio",
                ]
                # (7 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }
+       node_pool {
+           initial_node_count          = 1
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-6800f4fe-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-6800f4fe-grp",
            ]
+           max_pods_per_node           = 65
+           name                        = "core"
+           node_count                  = 1
+           node_locations              = [
+               "us-central1-a",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 2
+               min_node_count       = 1
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 10
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 1
+               machine_type      = "n2-standard-2"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-cinema.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (17 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.istioegress-deployment will be created
+   resource "kubernetes_manifest" "istioegress-deployment" {
+       manifest = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               selector = {
+                   matchLabels = {
+                       app   = "istio-egressgateway"
+                       istio = "egressgateway"
                    }
                }
+               template = {
+                   metadata = {
+                       annotations = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       labels      = {
+                           app   = "istio-egressgateway"
+                           istio = "egressgateway"
                        }
                    }
+                   spec     = {
+                       containers         = [
+                           {
+                               image     = "auto"
+                               name      = "istio-proxy"
+                               resources = {
+                                   limits   = {
+                                       cpu    = "2Gi"
+                                       memory = "1Gi"
                                    }
+                                   requests = {
+                                       cpu    = "100Mi"
+                                       memory = "128Mi"
                                    }
                                }
                            },
                        ]
+                       serviceAccountName = "istio-egressgateway"
                    }
                }
            }
        }
+       object   = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               minReadySeconds         = (known after apply)
+               paused                  = (known after apply)
+               progressDeadlineSeconds = (known after apply)
+               replicas                = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               selector                = {
+                   matchExpressions = (known after apply)
+                   matchLabels      = {
+                       "app"   = "istio-egressgateway"
+                       "istio" = "egressgateway"
                    }
                }
+               strategy                = {
+                   rollingUpdate = {
+                       maxSurge       = (known after apply)
+                       maxUnavailable = (known after apply)
                    }
+                   type          = (known after apply)
                }
+               template                = {
+                   metadata = {
+                       annotations                = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       clusterName                = (known after apply)
+                       creationTimestamp          = (known after apply)
+                       deletionGracePeriodSeconds = (known after apply)
+                       deletionTimestamp          = (known after apply)
+                       finalizers                 = (known after apply)
+                       generateName               = (known after apply)
+                       generation                 = (known after apply)
+                       labels                     = {
+                           "app"   = "istio-egressgateway"
+                           "istio" = "egressgateway"
                        }
+                       managedFields              = (known after apply)
+                       name                       = (known after apply)
+                       namespace                  = (known after apply)
+                       ownerReferences            = (known after apply)
+                       resourceVersion            = (known after apply)
+                       selfLink                   = (known after apply)
+                       uid                        = (known after apply)
                    }
+                   spec     = {
+                       activeDeadlineSeconds         = (known after apply)
+                       affinity                      = {
+                           nodeAffinity    = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = {
+                                   nodeSelectorTerms = (known after apply)
                                }
                            }
+                           podAffinity     = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
+                           podAntiAffinity = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
+                       automountServiceAccountToken  = (known after apply)
+                       containers                    = [
+                           {
+                               args                     = (known after apply)
+                               command                  = (known after apply)
+                               env                      = (known after apply)
+                               envFrom                  = (known after apply)
+                               image                    = "auto"
+                               imagePullPolicy          = (known after apply)
+                               lifecycle                = {
+                                   postStart = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
+                                   preStop   = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
                                }
+                               livenessProbe            = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               name                     = "istio-proxy"
+                               ports                    = (known after apply)
+                               readinessProbe           = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               resources                = {
+                                   limits   = {
+                                       "cpu"    = "2Gi"
+                                       "memory" = "1Gi"
                                    }
+                                   requests = {
+                                       "cpu"    = "100Mi"
+                                       "memory" = "128Mi"
                                    }
                                }
+                               securityContext          = {
+                                   allowPrivilegeEscalation = (known after apply)
+                                   capabilities             = {
+                                       add  = (known after apply)
+                                       drop = (known after apply)
                                    }
+                                   privileged               = (known after apply)
+                                   procMount                = (known after apply)
+                                   readOnlyRootFilesystem   = (known after apply)
+                                   runAsGroup               = (known after apply)
+                                   runAsNonRoot             = (known after apply)
+                                   runAsUser                = (known after apply)
+                                   seLinuxOptions           = {
+                                       level = (known after apply)
+                                       role  = (known after apply)
+                                       type  = (known after apply)
+                                       user  = (known after apply)
                                    }
+                                   seccompProfile           = {
+                                       localhostProfile = (known after apply)
+                                       type             = (known after apply)
                                    }
+                                   windowsOptions           = {
+                                       gmsaCredentialSpec     = (known after apply)
+                                       gmsaCredentialSpecName = (known after apply)
+                                       hostProcess            = (known after apply)
+                                       runAsUserName          = (known after apply)
                                    }
                                }
+                               startupProbe             = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               stdin                    = (known after apply)
+                               stdinOnce                = (known after apply)
+                               terminationMessagePath   = (known after apply)
+                               terminationMessagePolicy = (known after apply)
+                               tty                      = (known after apply)
+                               volumeDevices            = (known after apply)
+                               volumeMounts             = (known after apply)
+                               workingDir               = (known after apply)
                            },
                        ]
+                       dnsConfig                     = {
+                           nameservers = (known after apply)
+                           options     = (known after apply)
+                           searches    = (known after apply)
                        }
+                       dnsPolicy                     = (known after apply)
+                       enableServiceLinks            = (known after apply)
+                       ephemeralContainers           = (known after apply)
+                       hostAliases                   = (known after apply)
+                       hostIPC                       = (known after apply)
+                       hostNetwork                   = (known after apply)
+                       hostPID                       = (known after apply)
+                       hostname                      = (known after apply)
+                       imagePullSecrets              = (known after apply)
+                       initContainers                = (known after apply)
+                       nodeName                      = (known after apply)
+                       nodeSelector                  = (known after apply)
+                       os                            = {
+                           name = (known after apply)
                        }
+                       overhead                      = (known after apply)
+                       preemptionPolicy              = (known after apply)
+                       priority                      = (known after apply)
+                       priorityClassName             = (known after apply)
+                       readinessGates                = (known after apply)
+                       restartPolicy                 = (known after apply)
+                       runtimeClassName              = (known after apply)
+                       schedulerName                 = (known after apply)
+                       securityContext               = {
+                           fsGroup             = (known after apply)
+                           fsGroupChangePolicy = (known after apply)
+                           runAsGroup          = (known after apply)
+                           runAsNonRoot        = (known after apply)
+                           runAsUser           = (known after apply)
+                           seLinuxOptions      = {
+                               level = (known after apply)
+                               role  = (known after apply)
+                               type  = (known after apply)
+                               user  = (known after apply)
                            }
+                           seccompProfile      = {
+                               localhostProfile = (known after apply)
+                               type             = (known after apply)
                            }
+                           supplementalGroups  = (known after apply)
+                           sysctls             = (known after apply)
+                           windowsOptions      = {
+                               gmsaCredentialSpec     = (known after apply)
+                               gmsaCredentialSpecName = (known after apply)
+                               hostProcess            = (known after apply)
+                               runAsUserName          = (known after apply)
                            }
                        }
+                       serviceAccount                = (known after apply)
+                       serviceAccountName            = "istio-egressgateway"
+                       setHostnameAsFQDN             = (known after apply)
+                       shareProcessNamespace         = (known after apply)
+                       subdomain                     = (known after apply)
+                       terminationGracePeriodSeconds = (known after apply)
+                       tolerations                   = (known after apply)
+                       topologySpreadConstraints     = (known after apply)
+                       volumes                       = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.istioingress-deployment will be created
+   resource "kubernetes_manifest" "istioingress-deployment" {
+       manifest = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               selector = {
+                   matchLabels = {
+                       app   = "istio-ingressgateway"
+                       istio = "ingressgateway"
                    }
                }
+               template = {
+                   metadata = {
+                       annotations = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       labels      = {
+                           app   = "istio-ingressgateway"
+                           istio = "ingressgateway"
                        }
                    }
+                   spec     = {
+                       containers         = [
+                           {
+                               image     = "auto"
+                               name      = "istio-proxy"
+                               resources = {
+                                   limits   = {
+                                       cpu    = "2Gi"
+                                       memory = "1Gi"
                                    }
+                                   requests = {
+                                       cpu    = "100Mi"
+                                       memory = "128Mi"
                                    }
                                }
                            },
                        ]
+                       serviceAccountName = "istio-ingressgateway"
                    }
                }
            }
        }
+       object   = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               minReadySeconds         = (known after apply)
+               paused                  = (known after apply)
+               progressDeadlineSeconds = (known after apply)
+               replicas                = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               selector                = {
+                   matchExpressions = (known after apply)
+                   matchLabels      = {
+                       "app"   = "istio-ingressgateway"
+                       "istio" = "ingressgateway"
                    }
                }
+               strategy                = {
+                   rollingUpdate = {
+                       maxSurge       = (known after apply)
+                       maxUnavailable = (known after apply)
                    }
+                   type          = (known after apply)
                }
+               template                = {
+                   metadata = {
+                       annotations                = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       clusterName                = (known after apply)
+                       creationTimestamp          = (known after apply)
+                       deletionGracePeriodSeconds = (known after apply)
+                       deletionTimestamp          = (known after apply)
+                       finalizers                 = (known after apply)
+                       generateName               = (known after apply)
+                       generation                 = (known after apply)
+                       labels                     = {
+                           "app"   = "istio-ingressgateway"
+                           "istio" = "ingressgateway"
                        }
+                       managedFields              = (known after apply)
+                       name                       = (known after apply)
+                       namespace                  = (known after apply)
+                       ownerReferences            = (known after apply)
+                       resourceVersion            = (known after apply)
+                       selfLink                   = (known after apply)
+                       uid                        = (known after apply)
                    }
+                   spec     = {
+                       activeDeadlineSeconds         = (known after apply)
+                       affinity                      = {
+                           nodeAffinity    = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = {
+                                   nodeSelectorTerms = (known after apply)
                                }
                            }
+                           podAffinity     = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
+                           podAntiAffinity = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
+                       automountServiceAccountToken  = (known after apply)
+                       containers                    = [
+                           {
+                               args                     = (known after apply)
+                               command                  = (known after apply)
+                               env                      = (known after apply)
+                               envFrom                  = (known after apply)
+                               image                    = "auto"
+                               imagePullPolicy          = (known after apply)
+                               lifecycle                = {
+                                   postStart = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
+                                   preStop   = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
                                }
+                               livenessProbe            = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               name                     = "istio-proxy"
+                               ports                    = (known after apply)
+                               readinessProbe           = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               resources                = {
+                                   limits   = {
+                                       "cpu"    = "2Gi"
+                                       "memory" = "1Gi"
                                    }
+                                   requests = {
+                                       "cpu"    = "100Mi"
+                                       "memory" = "128Mi"
                                    }
                                }
+                               securityContext          = {
+                                   allowPrivilegeEscalation = (known after apply)
+                                   capabilities             = {
+                                       add  = (known after apply)
+                                       drop = (known after apply)
                                    }
+                                   privileged               = (known after apply)
+                                   procMount                = (known after apply)
+                                   readOnlyRootFilesystem   = (known after apply)
+                                   runAsGroup               = (known after apply)
+                                   runAsNonRoot             = (known after apply)
+                                   runAsUser                = (known after apply)
+                                   seLinuxOptions           = {
+                                       level = (known after apply)
+                                       role  = (known after apply)
+                                       type  = (known after apply)
+                                       user  = (known after apply)
                                    }
+                                   seccompProfile           = {
+                                       localhostProfile = (known after apply)
+                                       type             = (known after apply)
                                    }
+                                   windowsOptions           = {
+                                       gmsaCredentialSpec     = (known after apply)
+                                       gmsaCredentialSpecName = (known after apply)
+                                       hostProcess            = (known after apply)
+                                       runAsUserName          = (known after apply)
                                    }
                                }
+                               startupProbe             = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               stdin                    = (known after apply)
+                               stdinOnce                = (known after apply)
+                               terminationMessagePath   = (known after apply)
+                               terminationMessagePolicy = (known after apply)
+                               tty                      = (known after apply)
+                               volumeDevices            = (known after apply)
+                               volumeMounts             = (known after apply)
+                               workingDir               = (known after apply)
                            },
                        ]
+                       dnsConfig                     = {
+                           nameservers = (known after apply)
+                           options     = (known after apply)
+                           searches    = (known after apply)
                        }
+                       dnsPolicy                     = (known after apply)
+                       enableServiceLinks            = (known after apply)
+                       ephemeralContainers           = (known after apply)
+                       hostAliases                   = (known after apply)
+                       hostIPC                       = (known after apply)
+                       hostNetwork                   = (known after apply)
+                       hostPID                       = (known after apply)
+                       hostname                      = (known after apply)
+                       imagePullSecrets              = (known after apply)
+                       initContainers                = (known after apply)
+                       nodeName                      = (known after apply)
+                       nodeSelector                  = (known after apply)
+                       os                            = {
+                           name = (known after apply)
                        }
+                       overhead                      = (known after apply)
+                       preemptionPolicy              = (known after apply)
+                       priority                      = (known after apply)
+                       priorityClassName             = (known after apply)
+                       readinessGates                = (known after apply)
+                       restartPolicy                 = (known after apply)
+                       runtimeClassName              = (known after apply)
+                       schedulerName                 = (known after apply)
+                       securityContext               = {
+                           fsGroup             = (known after apply)
+                           fsGroupChangePolicy = (known after apply)
+                           runAsGroup          = (known after apply)
+                           runAsNonRoot        = (known after apply)
+                           runAsUser           = (known after apply)
+                           seLinuxOptions      = {
+                               level = (known after apply)
+                               role  = (known after apply)
+                               type  = (known after apply)
+                               user  = (known after apply)
                            }
+                           seccompProfile      = {
+                               localhostProfile = (known after apply)
+                               type             = (known after apply)
                            }
+                           supplementalGroups  = (known after apply)
+                           sysctls             = (known after apply)
+                           windowsOptions      = {
+                               gmsaCredentialSpec     = (known after apply)
+                               gmsaCredentialSpecName = (known after apply)
+                               hostProcess            = (known after apply)
+                               runAsUserName          = (known after apply)
                            }
                        }
+                       serviceAccount                = (known after apply)
+                       serviceAccountName            = "istio-ingressgateway"
+                       setHostnameAsFQDN             = (known after apply)
+                       shareProcessNamespace         = (known after apply)
+                       subdomain                     = (known after apply)
+                       terminationGracePeriodSeconds = (known after apply)
+                       tolerations                   = (known after apply)
+                       topologySpreadConstraints     = (known after apply)
+                       volumes                       = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
